//
//  DataStorage.swift
//  cardLayout
//
//  Created by Judge Madan on 8/8/18.
//  Copyright © 2018 Judge Madan. All rights reserved.
//

import UIKit

class Plant {
    
    let locationNames = ["Moss", "Cactus", "Fern", "Pothos", "Aloe Vera", "Dragon Tree", "Snake Plant", "Hoya", "Lucky Bamboo", "Sago Palm"]
        
    let locationImages = [UIImage(named: "1"), UIImage(named: "2"), UIImage(named: "3"), UIImage(named: "4"), UIImage(named: "5"), UIImage(named: "6"), UIImage(named: "7"), UIImage(named: "8"), UIImage(named: "9"), UIImage(named: "10")]
        
    let locationDescription = ["Medium/Hard", "Easy", "Medium", "Easy/Medium", "Easy", "Easy/Medium", "Easy", "Easy", "Easy/Medium", "Easy"]
    
    func getNames() -> Array<String> {
        return locationNames
    }
    func getImages() -> Array<UIImage> {
        return locationImages as! Array<UIImage>
    }
    func getDifficulty() -> Array<String> {
        return locationDescription
    }
    
    func getIDs() -> Array<Int> {
        let defaults = UserDefaults.standard
        if let storedPlants = defaults.array(forKey: "storedPlants") as? [Int] {
            return storedPlants
        }
        else{
            return []
        }
    }
    
    func getDesc() -> Array<String> {
        return ["เป็นพืชที่นิยมปลูกเพื่อเป็นฐานแก่ต้นอื่น หรือจะปลูกเดี่ยวๆก็ได้ โดยจะให้มุมมองเป็นทุ่งหญ้า ใช้พื้นที่เพียงเล็กน้อยจึงนิยมปลูกในบ้านด้วย", "พืชที่นิยมปลูกในหมู่นักสะสมและคนอยู่หอเพราะทั้งสวยงาม น่ารัก และ แข็งแรงอดทน กระบอกเพชรจึงเป็นพืชที่ปลูกง่ายสำหรับคนที่ไม่ค่อยมีเวลาดูแล", "เป็นพืชสวยงามที่ปลูกไม่ยากไม่ง่ายเกินไป นิยมนำมาตกแต่งบ้านมากเพราะลักษณะใบแต่ละชนิดของเฟิร์นที่สวยงาม", "เป็นพืชประดับที่สามารถปลูกได้ทั้งในบ้านและนอกบ้าน และสามารถเกาะสิ่งต่างๆไปได้ทำให้เป็นพืชที่มช้ตกแต่งบ้านได้สวยงาม", "เป็นพืชที่เหมาะกับการปลูกของนักเรียน/คนทำงานที่อยู่หอมากเพราะมันสามารถอยู่ได้นานและไม่จำเป็นต้องดูแลมาก", "เป็นไม้ประดับที่ค่อนข้างใหญ่ถ้าปลูกในบ้านโดยเฉพาะปลูกในหอ ต้นมีลักษณะตั้งตรงและทนทานมาก", "ต้นไม้ประดับสมัยใหม่ที่ให้ความเป็นmodernในการปลูกในบ้าน และยังค่อนข้างทนทานสำหรับมือใหม่", "ต้นไม้ประดับที่เป็นหนึ่งในของชำร่วยในงานแต่งงานเพราะมีใบเป็นรูปหัวใจ จากการขยายพันธุ์โดยมนุษย์ ทำให้แต่ละใบมีราก ทำให้โฮย่าแต่ละต้นมีขนาดเล็กน่ารักพอเหมาะ", "ต้นไม้ประดับที่เป็นที่นิยมเพราะขนาดเล็กและรูปร่างที่เติบโตขึ้นข้างบนเท่านั้น อีกทั้งเป็นต้นไม้ที่ให้ความเชื่อว่าเป็นต้นไม้มงคลที่ควรปลูกในบ้าน", "ต้นไม้ประดับที่มีขนาดใหญ่ในการปลูกในบ้าน และเป็นต้นที่ทนทานมาก"]

    }
    
    func getTips() -> Array<String> {
         return ["-ต้องรดน้ำให้ชุ่มชื้นตลอดเวลา\n-รดน้ำประมาณ1-2ครั้งต่อวัน\n-อย่าโดนแสงแดดจัด\n-ถ้ากลายเป็นสีเหลืองแปลว่ารดน้ำน้อยไป", "-วางในบริเวณที่มีแดดส่องจัดๆ\n-รอให้ดินแห้งเต็มที่แล้วค่อยรดน้ำ\n-รดน้ำประมาณ1-2ครั้งต่อเดือน", "-รดน้ำให้ชุ่มชื้นตลอดเวลา\n-ไม่ควรทำให้ดินแห้งเกินไป\n-รดน้ำประมาณวันละ1ครั้ง\n-อาจปลูกร่วมกันพืชต้นอื่นเพื่อเพิ่มความชื้นในอากาศให้เฟิร์น\n-ให้แสงน้อยถึงปานกลาง", "-ให้แสงน้อยถึงปานกลาง\n-รอให้ดินแห้งนิดๆระหว่างช่วงรดน้ำ\n-รดน้ำประมาณ1-2ครั้งต่อสัปดาห์", "-ให้แดดจัด\n-อย่ารดน้ำมากเกินไป\n-อย่าให้ดินแห้งเกินไประหว่างช่วงรดน้ำ\n-รดน้ำประมาณ1-2ครั้งต่อสัปดาห์", "-ให้แสงแดดได้ทุกรูปแบบ\n-รดน้ำประมาณสัปดาห์ละครั้ง", "-ให้แสงแดดได้ทุกรูปแบบ\n-รดน้ำประมาณสัปดาห์ละครั้ง", "-ให้แสงแดดปานกลาง\n-รดน้ำประมาณสัปดาห์ละครั้ง\n-ควรรอให้ดินแห้งสนิทในระหว่างช่วงการรดน้ำ", "-ให้แสงแดดปริมาณน้อยๆ\n-พยายามทำให้ดินชุ่มชื้นตลิดเวลา\n-รดน้ำประมาณ 1-2ครั้งต่อสัปดาห์", "-ให้แสงแดดปานกลาง\n-รดน้ำประมาณอาทิตย์ละครั้ง\n-ควรรอให้ดินแห้งระหว่างช่วงการรดน้ำ"]
    }
    
        
}

var plantData = Plant()
